app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-03-24 23:51:51.151717"], ["name", "Test 1"], ["updated_at", "2015-03-24 23:51:51.151717"]]

  def update
    Location.find(params["add_locations"]).each do |location|
---
SELECT "locations".* FROM "locations"  WHERE "locations"."id" IN (1, 2, 3)